canceling_text = Ваше действие было отменено
exit_text = До скорой встречи!
options_text = Выберите кнопку
select_lang_text = Выберите язык
set_lang_text = Установлен язык ->
accept_only_text = Пожалуйста, попробуйте еще раз. Я принимаю только текстовые сообщения!

# for command_start_handler func
user_in_db_text = Приветствую!  Я рад видеть вас снова!
new_user_text = Привет, друг! Что я могу для вас сделать?

# text for categories handlers
new_category_text = Напишите название категории ниже!
added_new_category_text = Вы успешно добавили новую категорию!
show_categories_text = Список ваших категорий:
empty_categories_text = У вас еще нет категорий
select_category_text = Выберите категорию
selected_category = Выбранная категория ->
rm_category_text = Вы удалили категорию ->
upd_category_text = Вы обновили категорию ->
correct_category_text = Пожалуйста, напишите правильное название категории.'
                        Название категории - это текст, не более 30 символов!
categories_is_fake_text = Выберите корректную категорию
category_exists_text = Категория с таким именем уже существует! Пожалуйста, напишите другое имя:
category_limit_text = Вы достигли предела количества категорий для этой категории.
"Пожалуйста, удалите все категории

# text for actions handlers
new_action_text = Напишите название действия ниже.
show_action_text = Ваши действия для категории ->
to_delete_action_text = Выберите действие для удаления
select_action_text = Выберите действие
to_update_action_text = Выберите действие для обновления
empty_actions_text = У вас пока нет никаких действий
rm_action_text = Вы удалили действие ->
upd_action_text = Вы обновили название своего действия
first_start_text = Пожалуйста, используйте кнопку "настройки" для настройки вашего трекера действий
correct_action_text = Пожалуйста, напишите правильное название действия. Название действия - это текст, не более 30 символов!
action_limit_text = Вы достигли предела количества действий для этой категории.
Пожалуйста, удалите любое действие или измените категорию
action_exists_text = Действие с таким именем уже существует! пожалуйста, напишите другое имя:
action_not_exists_text = Выберите корректное действие
added_new_action_text = Вы успешно добавили новое действие

# text for tracker handlers
new_tracker_text = Вы запустили трекер действия:
not_launched_tracker_text = У вас еще нет ни одного запущенного трекера!
already_launch_tracker_text = У вас уже есть запущенный трекер:
answer_stop_tracker_text = Вы хотите остановить трекер?
stop_tracker_text = Трекер остановлен:
daily_tracker_text = Удалить трекеры за день
empty_tracker_text = У вас еще нет трекеров
delete_tracker_text = Вы удалили трекер
just_one_tracker = Вы не можете запустить больше одного трекера за раз. Вы хотите остановить трекер?
not_enough_data_text = Я не могу создать трекер. Данные не определены.
already_delete_tracker_text = Вы уже удалили трекер
too_long_tracker = трекер на данное действие был автоматически остановлен и удален! Трекер не может работать дольше 23 часов!
tracker_daily_limit_text = Вы достигли дневного лимита количества трекеров
# for reports handlers
send_report_text = Это ваш недельный отчет!
empty_trackers_text = У вас нет никаких трекеров на эту неделю!

# для started_tracker_text функции
started_tracker_title = Запущенный трекер:
category_title = 🗄 Выбранная категория
action_title = 🎬 Выбранное действие
action_duration = ⏱ Продолжительность


# клавиатуры:
# ActionsButtonsData
USER_ACTIONS = 📋 Список действий
CREATE_ACTIONS = 🆕 Создать действие
UPDATE_ACTIONS = 🆙 Обновить действие
DELETE_ACTIONS = 🗑 Удалить действие


# CategoriesButtonsData
USER_CATEGORIES = 🗂 Список категорий
CREATE_CATEGORIES = 🆕 Создать категорию
UPDATE_CATEGORIES = 🆙 Обновить категорию
DELETE_CATEGORIES = 🗑 Удалить категорию


# GeneralButtonsData:
ACTIONS_BTN = 🎬 Действия
CATEGORIES_BTN = 🗄 Категории
REPORTS_BTN = 📊 Отчеты
TRACKERS_BTN = ⏱ Трекеры
YES_BTN = 🟩 Да
NO_BTN = 🟥 Нет
EXIT_BTN = ⬅️ выход
CANCEL_BTN = 🚫 отмена


# TrackersButtonsData
START_TRACKER_BTN = ▶️ Запуск трекера
DELETE_TRACKER_BTN = 🗑 Удалить трекеры
STOP_TRACKER_BTN = ⏹ Остановить трекер
DURATION_TRACKER_BTN = ⏳ Продолжительность


# ReportsButtonsData
WEEKLY_REPORT_BTN = 🗓 Недельный отчет

# SettingsButtonsData
LANGUAGE = 🌏 Язык
RUSSIA = 🇷🇺 Русский
X_RUSSIA = [X] 🇷🇺 Русский
ENGLISH = 🇬🇧 Английский
X_ENGLISH = [X] 🇬🇧 Английский